import os, sys
from termcolor import colored

logo = colored('''
.....             .
 .H8888888x.  '+    @88>
:888888888888x.  !   %8P      .u    .
8~    "*88888888"    .     .d88B :@8c       .u
!      .  f""""    .@88u  ="8888f8888r   ud8888.
 ~:...- :8L <)88: ''888E   4888>'88"  :888'8888.
    .   :888:>X88!   888E    4888> '    d888 '88%"
 :~"88x 48888X ^    888E    4888>      8888.+"
<  :888k'88888X      888E   .d888L .+   8888L
  d8888f '88888X     888&   ^"8888*"    '8888c. .+
 :8888!    ?8888>    R888"     "Y"       "88888%
 X888!      8888~     ""                   "YP'
 '888       X88f
  '%8:     .8*"
     ^----~"                           .
                           oec :    @88>
                          @88888    %8P      .u    .
                          8"*88%     .     .d88B :@8c       .u
                          8b.      .@88u  ="8888f8888r   ud8888.
                         u888888> ''888E   4888>'88"  :888'8888.
                          8888R     888E    4888> '    d888 '88%"
                          8888P     888E    4888>      8888.+"
                          *888>     888E   .d888L .+   8888L
                          4888      888&   ^"8888*"    '8888c. .+
                          '888      R888"     "Y"       "88888%
                           88R       ""                   "YP'
                           88>
                           48
                           '8
''', 'red')

menu = '''

                        by @batyarimskiy (TG)
                       t.me/weaknessinjection

                ---------------------------------------

                   1. Weber - Сканер уязвимостей
                   2. Nmap - Сканер портов
                   3. adminFind - Поиск админки сайта
                   4. hydra - брутфорс (ssh, ftp)
                   5. Чекер сайта на доступность
                   6. Cloud - Killer 
                   
                   7. Обновить
                   8. Выход

                ----------------------------------------
'''
